node {
  name: "global_step/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/input"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1
          }
        }
        string_val: "exout/ftrain-00000-of-00001.tfrecord.gz"
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/Size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/Greater/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/Greater"
  op: "Greater"
  input: "read_batch_features/file_name_queue/Size"
  input: "read_batch_features/file_name_queue/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/Assert/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/Assert/Assert"
  op: "Assert"
  input: "read_batch_features/file_name_queue/Greater"
  input: "read_batch_features/file_name_queue/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/Identity"
  op: "Identity"
  input: "read_batch_features/file_name_queue/input"
  input: "^read_batch_features/file_name_queue/Assert/Assert"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/RandomShuffle"
  op: "RandomShuffle"
  input: "read_batch_features/file_name_queue/Identity"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "read_batch_features/file_name_queue"
  op: "FIFOQueueV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/file_name_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/file_name_queue/RandomShuffle"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/file_name_queue_Close"
  op: "QueueCloseV2"
  input: "read_batch_features/file_name_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/file_name_queue_Close_1"
  op: "QueueCloseV2"
  input: "read_batch_features/file_name_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/file_name_queue_Size"
  op: "QueueSizeV2"
  input: "read_batch_features/file_name_queue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/Cast"
  op: "Cast"
  input: "read_batch_features/file_name_queue/file_name_queue_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/mul"
  op: "Mul"
  input: "read_batch_features/file_name_queue/Cast"
  input: "read_batch_features/file_name_queue/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/fraction_of_32_full/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "read_batch_features/file_name_queue/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "read_batch_features/file_name_queue/fraction_of_32_full"
  op: "ScalarSummary"
  input: "read_batch_features/file_name_queue/fraction_of_32_full/tags"
  input: "read_batch_features/file_name_queue/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_1"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_1/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_1"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_1"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_1/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_2"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_2/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_2"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_2"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_2/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_3"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_3/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_3"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_3"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_3/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_4"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_4/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_4"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_4"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_4/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_5"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_5/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_5"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_5"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_5/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_6"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_6/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_6"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_6"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_6/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_7"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_7/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_7"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_7"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_7/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_8"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_8/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_8"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_8"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_8/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_9"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_9/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_9"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_9"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_9/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_10"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_10/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_10"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_10"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_10/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/read/TFRecordReaderV2_11"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "GZIP"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_11/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "read_batch_features/read/ReaderReadUpToV2_11"
  op: "ReaderReadUpToV2"
  input: "read_batch_features/read/TFRecordReaderV2_11"
  input: "read_batch_features/file_name_queue"
  input: "read_batch_features/read/ReaderReadUpToV2_11/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: true
      }
    }
  }
}
node {
  name: "read_batch_features/random_shuffle_queue"
  op: "RandomShuffleQueueV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 1210
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 910
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "read_batch_features/cond/Switch"
  op: "Switch"
  input: "read_batch_features/Const"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond/switch_t"
  op: "Identity"
  input: "read_batch_features/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond/switch_f"
  op: "Identity"
  input: "read_batch_features/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond/pred_id"
  op: "Identity"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond/random_shuffle_queue_EnqueueMany/Switch"
  op: "Switch"
  input: "read_batch_features/random_shuffle_queue"
  input: "read_batch_features/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond/random_shuffle_queue_EnqueueMany/Switch_1"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2"
  input: "read_batch_features/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond/random_shuffle_queue_EnqueueMany/Switch_2"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2:1"
  input: "read_batch_features/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond/random_shuffle_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "read_batch_features/cond/random_shuffle_queue_EnqueueMany/Switch:1"
  input: "read_batch_features/cond/random_shuffle_queue_EnqueueMany/Switch_1:1"
  input: "read_batch_features/cond/random_shuffle_queue_EnqueueMany/Switch_2:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "read_batch_features/cond/control_dependency"
  op: "Identity"
  input: "read_batch_features/cond/switch_t"
  input: "^read_batch_features/cond/random_shuffle_queue_EnqueueMany"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/cond/switch_t"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond/NoOp"
  op: "NoOp"
  input: "^read_batch_features/cond/switch_f"
}
node {
  name: "read_batch_features/cond/control_dependency_1"
  op: "Identity"
  input: "read_batch_features/cond/switch_f"
  input: "^read_batch_features/cond/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/cond/switch_f"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond/Merge"
  op: "Merge"
  input: "read_batch_features/cond/control_dependency_1"
  input: "read_batch_features/cond/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/Switch"
  op: "Switch"
  input: "read_batch_features/Const"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/switch_t"
  op: "Identity"
  input: "read_batch_features/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/switch_f"
  op: "Identity"
  input: "read_batch_features/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/pred_id"
  op: "Identity"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/random_shuffle_queue_EnqueueMany/Switch"
  op: "Switch"
  input: "read_batch_features/random_shuffle_queue"
  input: "read_batch_features/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/random_shuffle_queue_EnqueueMany/Switch_1"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2_1"
  input: "read_batch_features/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/random_shuffle_queue_EnqueueMany/Switch_2"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2_1:1"
  input: "read_batch_features/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/random_shuffle_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "read_batch_features/cond_1/random_shuffle_queue_EnqueueMany/Switch:1"
  input: "read_batch_features/cond_1/random_shuffle_queue_EnqueueMany/Switch_1:1"
  input: "read_batch_features/cond_1/random_shuffle_queue_EnqueueMany/Switch_2:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "read_batch_features/cond_1/control_dependency"
  op: "Identity"
  input: "read_batch_features/cond_1/switch_t"
  input: "^read_batch_features/cond_1/random_shuffle_queue_EnqueueMany"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/cond_1/switch_t"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/NoOp"
  op: "NoOp"
  input: "^read_batch_features/cond_1/switch_f"
}
node {
  name: "read_batch_features/cond_1/control_dependency_1"
  op: "Identity"
  input: "read_batch_features/cond_1/switch_f"
  input: "^read_batch_features/cond_1/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/cond_1/switch_f"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_1/Merge"
  op: "Merge"
  input: "read_batch_features/cond_1/control_dependency_1"
  input: "read_batch_features/cond_1/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/Switch"
  op: "Switch"
  input: "read_batch_features/Const"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/switch_t"
  op: "Identity"
  input: "read_batch_features/cond_2/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/switch_f"
  op: "Identity"
  input: "read_batch_features/cond_2/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/pred_id"
  op: "Identity"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/random_shuffle_queue_EnqueueMany/Switch"
  op: "Switch"
  input: "read_batch_features/random_shuffle_queue"
  input: "read_batch_features/cond_2/pred_id"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/random_shuffle_queue_EnqueueMany/Switch_1"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2_2"
  input: "read_batch_features/cond_2/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2_2"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/random_shuffle_queue_EnqueueMany/Switch_2"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2_2:1"
  input: "read_batch_features/cond_2/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2_2"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/random_shuffle_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "read_batch_features/cond_2/random_shuffle_queue_EnqueueMany/Switch:1"
  input: "read_batch_features/cond_2/random_shuffle_queue_EnqueueMany/Switch_1:1"
  input: "read_batch_features/cond_2/random_shuffle_queue_EnqueueMany/Switch_2:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "read_batch_features/cond_2/control_dependency"
  op: "Identity"
  input: "read_batch_features/cond_2/switch_t"
  input: "^read_batch_features/cond_2/random_shuffle_queue_EnqueueMany"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/cond_2/switch_t"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/NoOp"
  op: "NoOp"
  input: "^read_batch_features/cond_2/switch_f"
}
node {
  name: "read_batch_features/cond_2/control_dependency_1"
  op: "Identity"
  input: "read_batch_features/cond_2/switch_f"
  input: "^read_batch_features/cond_2/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/cond_2/switch_f"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_2/Merge"
  op: "Merge"
  input: "read_batch_features/cond_2/control_dependency_1"
  input: "read_batch_features/cond_2/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/Switch"
  op: "Switch"
  input: "read_batch_features/Const"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/switch_t"
  op: "Identity"
  input: "read_batch_features/cond_3/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/switch_f"
  op: "Identity"
  input: "read_batch_features/cond_3/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/pred_id"
  op: "Identity"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/random_shuffle_queue_EnqueueMany/Switch"
  op: "Switch"
  input: "read_batch_features/random_shuffle_queue"
  input: "read_batch_features/cond_3/pred_id"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/random_shuffle_queue_EnqueueMany/Switch_1"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2_3"
  input: "read_batch_features/cond_3/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2_3"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/random_shuffle_queue_EnqueueMany/Switch_2"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2_3:1"
  input: "read_batch_features/cond_3/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2_3"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/random_shuffle_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "read_batch_features/cond_3/random_shuffle_queue_EnqueueMany/Switch:1"
  input: "read_batch_features/cond_3/random_shuffle_queue_EnqueueMany/Switch_1:1"
  input: "read_batch_features/cond_3/random_shuffle_queue_EnqueueMany/Switch_2:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "read_batch_features/cond_3/control_dependency"
  op: "Identity"
  input: "read_batch_features/cond_3/switch_t"
  input: "^read_batch_features/cond_3/random_shuffle_queue_EnqueueMany"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/cond_3/switch_t"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/NoOp"
  op: "NoOp"
  input: "^read_batch_features/cond_3/switch_f"
}
node {
  name: "read_batch_features/cond_3/control_dependency_1"
  op: "Identity"
  input: "read_batch_features/cond_3/switch_f"
  input: "^read_batch_features/cond_3/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/cond_3/switch_f"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_3/Merge"
  op: "Merge"
  input: "read_batch_features/cond_3/control_dependency_1"
  input: "read_batch_features/cond_3/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_4/Switch"
  op: "Switch"
  input: "read_batch_features/Const"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_4/switch_t"
  op: "Identity"
  input: "read_batch_features/cond_4/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_4/switch_f"
  op: "Identity"
  input: "read_batch_features/cond_4/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_4/pred_id"
  op: "Identity"
  input: "read_batch_features/Const"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_4/random_shuffle_queue_EnqueueMany/Switch"
  op: "Switch"
  input: "read_batch_features/random_shuffle_queue"
  input: "read_batch_features/cond_4/pred_id"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_4/random_shuffle_queue_EnqueueMany/Switch_1"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2_4"
  input: "read_batch_features/cond_4/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2_4"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_4/random_shuffle_queue_EnqueueMany/Switch_2"
  op: "Switch"
  input: "read_batch_features/read/ReaderReadUpToV2_4:1"
  input: "read_batch_features/cond_4/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@read_batch_features/read/ReaderReadUpToV2_4"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "read_batch_features/cond_4/random_shuffle_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "read_batch_features/cond_4/random_shuffle_queue_EnqueueMany/Switch:1"
  input: "read_batch_features/cond_4/random_shuffle_queue_EnqueueMany/Switch_1:1"
  input: "read_batch_features/cond_4/random_shuffle_queue_EnqueueMany/Switch_2:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "read_batch_features/cond_4/control_dependency"
  op: "Identity"
  input: "read_batch_features/cond_4/switch_t"
  input: "^read_batch_features/cond_4/random_shuffle_queue_EnqueueMany"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
